Tekla.Structures.Analysis.AnalysisModel.resultsFrozen
Indicates whether the results are frozen.

Tekla.Structures.Analysis.AnalysisModel.physicalFrozen
Indicates whether the physical objects are frozen.

Tekla.Structures.Analysis.AnalysisModel.#ctor
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisModel class.

Tekla.Structures.Analysis.AnalysisModel.ConstructionMethod
Gets or sets the construction method of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.FilterName
Gets or sets the filter name of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.AnalysisMethod
Gets or sets the analysis method of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.AnalysisEngine
Gets or sets the analysis engine of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.UseModelMerge
Gets or sets a value indicating whether model merge is used.

Tekla.Structures.Analysis.AnalysisModel.NumberOfIterations
Gets or sets the number of iterations of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.IncludeImperfections
Gets or sets a value indicating whether imperfections are to be included.

Tekla.Structures.Analysis.AnalysisModel.RelativeAccuracy
Gets or sets the relative accuracy of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.ModelUpdateModificationIdentifier
Gets or sets the identifier of the model update modification.

Tekla.Structures.Analysis.AnalysisModel.ResultsModificationIdentifier
Gets or sets the results modification identifier.

Tekla.Structures.Analysis.AnalysisModel.ResultsTime
Gets or sets the results time.

Tekla.Structures.Analysis.AnalysisModel.ResultsFrozen
Gets or sets a value indicating whether the results are frozen.

Tekla.Structures.Analysis.AnalysisModel.PhysicalFrozen
Gets or sets a value indicating whether the physical objects are frozen.

Tekla.Structures.Analysis.AnalysisModel.ResultsFreezed
Gets or sets a value indicating whether the results are frozen.
Deprecated since TS2018, use ResultsFrozen.

Tekla.Structures.Analysis.AnalysisModel.PhysicalFreezed
Gets or sets a value indicating whether the physical objects are frozen.
Deprecated since TS2018, use PhysicalFrozen.

Tekla.Structures.Analysis.AnalysisModel.BracingFilterName
Gets or sets the bracing filter name.

Tekla.Structures.Analysis.AnalysisModel.SecondaryMemberFilterName
Gets or sets the secondary member filter name.

Tekla.Structures.Analysis.AnalysisModel.AutodetectSecondaries
Gets or sets a value indicating whether bracing members are detected automatically.
Deprecated since TS2018, analysis model no longer has this property.

Tekla.Structures.Analysis.AnalysisModel.SecondaryFilterName
Gets or sets the bracing filter name.
Deprecated since TS2018, use BracingFilterName instead.

Tekla.Structures.Analysis.AnalysisModel.SecondaryKeepAxis
Gets or sets the secondary keep axis settings.
Not used, bracing/secondary members always have KEEP_AXIS_NO initially.
Deprecated since TS2018.

Tekla.Structures.Analysis.AnalysisModel.NodePositionTolerance
Gets or sets the node position tolerance of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.SnapDistance
Gets or sets the snap distance of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.UseTrueCurvedMembers
Gets or sets a value indicating whether members are true curved.

Tekla.Structures.Analysis.AnalysisModel.UseTwinProfiles
Gets or sets a value indicating whether twin profiles are used.

Tekla.Structures.Analysis.AnalysisModel.AnalysisConnectivityRules
Gets or sets the analysis model connectivity rules.

Tekla.Structures.Analysis.AnalysisModel.MemberAxislocation
Gets or sets the axis location of the members.

Tekla.Structures.Analysis.AnalysisModel.MemberEndReleaseMethodByJoint
Gets or sets a value indicating whether the end releases are set by joint properties.

Tekla.Structures.Analysis.AnalysisModel.AnalysisModelDesignProperties
Gets or sets the analysis model design properties.

Tekla.Structures.Analysis.AnalysisModel.AnalysisModelJobProperties
Gets or sets the analysis model job properties.

Tekla.Structures.Analysis.AnalysisModel.AnalysisModelModalAnalysisProperties
Gets or sets the analysis model modal analysis properties.

Tekla.Structures.Analysis.AnalysisModel.AnalysisModelOutputProperties
Gets or sets the analysis model output properties.

Tekla.Structures.Analysis.AnalysisModel.AnalysisModelSeismicProperties
Gets or sets the analysis model seismic properties.

Tekla.Structures.Analysis.AnalysisModel.AnalysisModelSpectrumProperties
Gets or sets the analysis model spectrum properties

Tekla.Structures.Analysis.AnalysisModel.AnalysisParts
Gets the analysis parts of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.AnalysisNodes
Gets the analysis nodes of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.AnalysisNodeLinks
Gets the analysis node links of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.AnalysisRigidDiaphragms
Gets the analysis rigid diaphragms of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.AnalysisLoadGroups
Gets the analysis load groups of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.AnalysisLoadCombinations
Gets the analysis load combinations of the analysis model.

Tekla.Structures.Analysis.AnalysisModel.Select
Selects an analysis model. Updates the model.
The AnalysisModelName or ID has to be set.

Tekla.Structures.Analysis.AnalysisModel.Select(System.Boolean)
Selects an analysis model.
The AnalysisModelName or ID has to be set.
update: Indicates whether analysis model is updated.
Returns: True if successful.

Tekla.Structures.Analysis.AnalysisModel.GetIssues
Get analysis model issues.
Returns: The analysis model issues.

Tekla.Structures.Analysis.AnalysisModel.SelectInstance(System.Boolean)
DO NOT USE! For internal usage only!
update: Indicates whether analysis model is updated.
Returns: Success.